---
kind: method
id: M:Autodesk.Revit.DB.IntersectionResultArray.ReverseIterator
source: html/9df89750-b335-dc6e-9c4d-49c51423fbdf.htm
---
# Autodesk.Revit.DB.IntersectionResultArray.ReverseIterator Method

Retrieve a backward moving iterator to the array.

## Syntax (C#)
```csharp
public virtual IntersectionResultArrayIterator ReverseIterator()
```

## Returns
Returns a backward moving iterator to the array.